#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repos.github_repository.repository_branch_autoinit["terraform-jrs-local"] has changed
  ~ resource "github_repository" "repository_branch_autoinit" {
      ~ etag                        = "W/\"a1427b456df29729998a7feebe8c7dd42831f958907e440b95ba2cbff5ddf2f1\"" -> "W/\"059eadf6159374a6b659b4a6805eee1ffa97747d3090a14794976a8380ca98ad\""
        id                          = "terraform-jrs-local"
        name                        = "terraform-jrs-local"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos.github_branch_default.default["MS-Test14"] will be created
  + resource "github_branch_default" "default" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = true
      + repository = "MS-Test14"
    }

  # module.repos.github_branch_protection.branch_policy[4] will be created
  + resource "github_branch_protection" "branch_policy" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "master"
      + repository_id                   = "MS-Test14"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # module.repos.github_repository.repository_branch_autoinit["MS-Test14"] will be created
  + resource "github_repository" "repository_branch_autoinit" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository managed by Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "MS-Test14"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos.github_repository_file.pipeline_file[5] will be created
  + resource "github_repository_file" "pipeline_file" {
      + branch              = "refs/heads/master"
      + commit_message      = "Añade o actualiza pipelines_file via terraform ***NO_CI***"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: 001-ms-template-caller
            
            on:
              push:
                branches: none # [ main ]
              pull_request:
                branches: none # [ main ]
            
              # Allows you to run this workflow manually from the Actions tab
              workflow_dispatch:
            
            jobs:
              call-pipeline-workflow-A:
                uses: josue-r/Pipelines/.github/workflows/github-pipelines.yml@main
                with:
                  username: Josue
                  lastname: Ruiz
                secrets:
                  token: ${{ secrets.TOKEN }}
            
              call-pipeline-workflow-B:
                uses: josue-r/Pipelines/.github/workflows/github-pipelines.yml@main
                with:
                  username: Vero
                  lastname: Zamora
                secrets:
                  token: ${{ secrets.TOKEN }}
        EOT
      + file                = ".github/workflows/github-pipelines.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "MS-Test14"
      + sha                 = (known after apply)
    }

  # module.repos.github_repository_file.pr_template[5] will be created
  + resource "github_repository_file" "pr_template" {
      + branch              = "refs/heads/master"
      + commit_message      = "Añade o actualiza pr_template via terraform ***NO_CI***"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## What does this PR do?
            
            [comment]: <> (A brief explanation synthesizing the feature, bug or, fix.)
            
            - this
            - that
            
            ## Where should the reviewer start?
            
            [comment]: <> (Explain where the reviewer should start to review the whole addition or subtractions.)
            :checkered_flag:
            
            ## How should this be manually tested?
            
            [comment]: <> (List of steps to reproduce, corroborate, or tests to run. Write this section enough so that external users can also follow it and test the fix.)
            
            1. :one:
            2. :two:
            3. :tada:
            
            ## Any background context you want to provide?
            
            [comment]: <> (Any information regarding the PR that the reviewer should know.)
            :construction:
            
            ## What are the relevant tickets?
            
            [comment]: <> (Link to issues, related PR, JIRA issues, etc.)
            Closes [JIRA/Monday/{TICKET_ID}]()
            
            ## Screenshots
            
            [comment]: <> (Screenshots of the feature if available.)
            :camera:
            
            ## Questions
            
            [comment]: <> (If available, to another developer or reviewer.)
            :question:
        EOT
      + file                = ".github/pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "MS-Test14"
      + sha                 = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repo_full_name = {
      + MS-Test14           = (known after apply)
        # (5 unchanged elements hidden)
    }

```

</details>


*Pusher: @josue-r, Action: `pull_request`, Working Directory: `/home/josue/actions-runner/_work/terraform-jrs-local/terraform-jrs-local`, Workflow: `Create terraform plan`*